# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 4, 4 ]]  # 0-P1/2
  - [-1, 1, vanillanetBlock, [128, 1, 2]]  # 1-P2/4
  - [-1, 1, vanillanetBlock, [256, 1, 2]]
  - [-1, 1, vanillanetBlock, [512, 1, 2]]  # 3-P3/8
  - [-1, 1, vanillanetBlock, [512, 1, 1]]
  - [-1, 1, PSA, [512]] # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2fCIB, [1024]]  # 21 (P5/32-large)

  - [[10, 13, 16], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
